jh-elec/C-Librarys/Atmega - Timer/timer.h
/*************************************************************
*|
*|	\@file  	timer.h
*|	\@brief 	-
*|	\@author 	J.H - Elec(C)
*|
*|	\@project	Atmega Timer Treiber
*|
*|	\@date		22/10/2019 - first implementation
*|
*|	\@todo 		
*|            
*|		
*|	\@test		Timer 0 : Es wurde erfolgreich der Compare Match Interrupt in betrieb genommen ( MEGA32 ).
*|				Timer 1 : Es wurde erfolgreich der Compare Match A + B Interrupt in betrieb genommen ( MEGA32 ).
*|				Timer 2 Comp : Erfolgreich in Betrieb genommen ( MEGA32 ).
*|				
*|	\@bug		no bug known
*|
*|
*|	\@version	1.0.211019
*|
*|**************************************************************/

#ifndef __TIMER_H__
#define __TIMER_H__

#include <stdio.h>
#include <avr/io.h>
#include <avr/interrupt.h>



/*!<-- Definierungen <--*/
/*****************************************************************/

/*!<-- Waveform Generation Mode Bits <--*/
#define _TMR0_MODE0					( ! ( 1 << WGM00 | 1 << WGM01 ) ) // Normal
#define _TMR0_MODE2					( 1 << WGM01 ) // CTC

#define _TMR1_MODE0					( ! ( 1 << WGM13 | 1 << WGM12 | 1 << WGM11 | 1 << WGM10 ) ) // Normal
#define _TMR1_MODE4					( 1 << WGM12 ) // CTC

#define _TMR2_MODE0					( ! ( 1 << WGM21 | 1 << WGM20 ) ) // Normal
#define _TMR2_MODE2					( 1 << WGM21 ) // CTC
/*!<-- Waveform Generation Mode Bits // Ende <--*/

/*!<-- Prescaler Mode Group Position <--*/
#define _TMR_PRE_OFFSET				( << 0 )

#define _TMR0_PRE_1					( 0b001 << _TMR_PRE_OFFSET )
#define _TMR0_PRE_8					( 0b010 << _TMR_PRE_OFFSET )
#define _TMR0_PRE_64				( 0b011 << _TMR_PRE_OFFSET )
#define _TMR0_PRE_256				( 0b100 << _TMR_PRE_OFFSET )
#define _TMR0_PRE_1024				( 0b101 << _TMR_PRE_OFFSET )

#define _TMR1_PRE_1					( 0b001 << _TMR_PRE_OFFSET )
#define _TMR1_PRE_8					( 0b010 << _TMR_PRE_OFFSET )
#define _TMR1_PRE_64				( 0b011 << _TMR_PRE_OFFSET )
#define _TMR1_PRE_256				( 0b100 << _TMR_PRE_OFFSET )
#define _TMR1_PRE_1024				( 0b101 << _TMR_PRE_OFFSET )

#define _TMR2_PRE_1					( 0b001 << _TMR_PRE_OFFSET )
#define _TMR2_PRE_8					( 0b010 << _TMR_PRE_OFFSET )
#define _TMR2_PRE_32				( 0b011 << _TMR_PRE_OFFSET )
#define _TMR2_PRE_64				( 0b100 << _TMR_PRE_OFFSET )
#define _TMR2_PRE_128				( 0b101 << _TMR_PRE_OFFSET )
#define _TMR2_PRE_256				( 0b110 << _TMR_PRE_OFFSET )
#define _TMR2_PRE_1024				( 0b111 << _TMR_PRE_OFFSET )
	

/*!<-- TIMSK Interrupt Configuration <--*/
#if defined( __AVR_ATmega328P__ )
  
	 /*!<-- ATmega328P <--*/

	  /*!<-- TCCR0A – Timer/Counter0 Control Register A [7..0] <--*/
	/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	  + COM0A1 | COM0A0 | COM0B1 | COM0B0 | – | – | WGM01 | WGM00        +
	  ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
		#define TCCR0A_WGM( _WGMxx )				TCCR0A |= ( _WGMxx & ( ( 1 << WGM01 ) | ( 1 << WGM00 ) ) )

	  /*!<-- TCCR0B – Timer/Counter0 Control Register A [7..0] <--*/
	/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	  + FOC0A | FOC0B | – | – | WGM02 | CS02 | CS01 | CS00               +
	  ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
		#define TCCR0B_WGM_CS( _WGMxx , _CSxx )		TCCR0B |= ( _WGMxx & ( 1 << WGM02 ) ) |  ( _CSxx & (( 1 << CS02 ) | ( 1 << CS01 ) | ( 1 << CS00 ) ) )

	  /*!<-- TCCR1A – Timer/Counter1 Control Register A [7..0] <--*/
	/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	  + COM1A1 | COM1A0 | COM1B1 | COM1B0 | – | – | WGM11 | WGM10        +
	  ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
		#define TCCR1A_WGM( _WGMxx )				TCCR1A |= ( _WGMxx & ( ( 1 << WGM11 ) | ( 1 << WGM10 ) ) )
 
	  /*!<-- TCCR1B – Timer/Counter1 Control Register B [7..0] <--*/
	/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	  + ICNC1 | ICES1 | – | WGM13 | WGM12 | CS12 | CS11 | CS10           +
	  ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/ 
		#define TCCR1B_WGM_CS( _WGMxx , _CSxx )		TCCR1B |= ( _WGMxx & ( 1 << WGM13 | 1 << WGM12 ) ) | ( _CSxx & ( ( 1 << CS12 ) | ( 1 << CS11 ) | ( 1 << CS10 ) ) 
 
	  /*!<-- TIMSK1 – Timer/Counter Interrupt Mask Register [7..0] <--*/
	/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	  + – | – | ICIE1 | – | – | OCIE1B | OCIE1A | TOIE1                  +
	  ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/   
		#define TIMSK1_OCIE1A_EN					TIMSK1 |= ( 1 << OCIE1A ) 
		#define TIMSK1_OCIE1B_EN					TIMSK1 |= ( 1 << OCIE1B )
		#define TIMSK1_TOIE1_EN						TIMSK1 |= ( 1 << TOIE1  )


	  /*!<-- TIMSK0 – Timer/Counter Interrupt Mask Register [7..0] <--*/
	/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	  + - | - | - | - | - | OCIE0B | OCIE0A | TOIE0                      +
	  ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/   
		#define TIMSK0_TOIE0_EN						TIMSK0 |= ( 1 << TOIE0  ) 
		#define TIMSK0_OCIE0A_EN					TIMSK0 |= ( 1 << OCIE0A )
		#define TIMSK0_OCIE0B_EN					TIMSK0 |= ( 1 << OCIE0B )
		

	  /*!<-- TCCR2A – Timer/Counter Control Register A [7..0] <--*/
	/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	  + COM2A1 | COM2A0 | COM2B1 | COM2B0 | – | – | WGM21 | WGM20        +
	  ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/  
		#define TCCR2A_WGM( _WGMxx )				TCCR2A |= ( _WGMxx & ( ( 1 << WGM21 ) | ( 1 << WGM20 ) ) ) 

	  /*!<-- TCCR2B – Timer/Counter Control Register B [7..0] <--*/
	/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	  + FOC2A | FOC2B | – | – | WGM22 | CS22 | CS21 | CS20               +
	  ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/  
		#define TCCR2B_WGM_CS( _WGMxx , _CSxx )		TCCR2B |= ( _WGMxx & 1 << WGM22 ) | ( _CSxx & ( ( 1 << CS22 ) | ( 1 << CS21 ) | ( 1 << CS20 ) ) )			
		

	  /*!<-- TIMSK2 – Timer/Counter2 Interrupt Mask Register [7..0] <--*/
	/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	  + – | – | – | – | – | OCIE2B | OCIE2A | TOIE2                      +
	  ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/ 
		#define TIMSK2_TOIE2_EN						TIMSK2 |= ( 1 << TOIE2  )
		#define TIMSK2_OCIE2A_EN					TIMSK2 |= ( 1 << OCIE2A )
		#define TIMSK2_OCIE2B_EN					TIMSK2 |= ( 1 << OCIE2B )
  
	 /*!<-- ATmega328P // End <--*/

	
