jh-elec/C-Librarys/Atmega - Timer/timer.h
#elif defined  ( __AVR_ATmega32__ )	

	/*!<-- ATmega32 <--*/

	  /*!<-- TCCR0 – Timer/Counter Control Register [7..0] <--*/
	/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	  + FOC0 | WGM00 | COM01 | COM00 | WGM01 | CS02 | CS01 |  CS00       +
	  ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
		#define TCCR0_WGM_CS( _WGMxx , _CSxx )		TCCR0 |= ( (_WGMxx  & (( 1 << WGM00 ) | ( 1 << WGM01 ) ) )| ( _CSxx & ( ( 1 << CS02 ) | ( 1 << CS01 ) | ( 1 << CS00 ) ) ) )
	
	  /*!<-- TIMSK – Timer/Counter Interrupt Mask Register [7..0] <--*/
	/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	  + OCIE2 | TOIE2 | TICIE1 | OCIE1A | OCIE1B | TOIE1 | OCIE0 | TOIE0 +
	  ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/   
		#define TIMSK_OCIE2_EN						TIMSK |= ( 1 << OCIE2  )
		#define TIMSK_TOIE2_EN						TIMSK |= ( 1 << TOIE2  )
		#define TIMSK_OCIE1A_EN						TIMSK |= ( 1 << OCIE1A )
		#define TIMSK_OCIE1B_EN						TIMSK |= ( 1 << OCIE1B )
		#define TIMSK_TOIE1_EN						TIMSK |= ( 1 << TOIE1  )
		#define TIMSK_OCIE0_EN						TIMSK |= ( 1 << OCIE0  )
		#define TIMSK_TOIE0_EN						TIMSK |= ( 1 << TOIE0  )
		
	  /*!<-- TCCR1A – Timer/Counter1 Control Register A [7..0] <--*/
	/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	  + COM1A1 | COM1A0 | COM1B1 | COM1B0 | FOC1A | FOC1B | WGM11 | WGM10 +
	  +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/  
		#define TCCR1A_WGM( _WGMxx )				TCCR1A |= ( _WGMxx & ( ( 1 << WGM11 ) | ( 1 << WGM10 ) ) )
  
	  /*!<-- TCCR1B – Timer/Counter1 Control Register B [7..0] <--*/
	/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	  + ICNC1 | ICES1 | – | WGM13 | WGM12 | CS12 | CS11 | CS10            +
	  +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/  
		#define TCCR1B_WGM_CS( _WGMxx , _CSxx )		TCCR1B |= ( _WGMxx & (( 1 << WGM13) | ( 1 << WGM12 ) ) ) | ( _CSxx & ( ( 1 << CS12 ) | ( 1 << CS11 ) | ( 1 << CS10 ) ) )
	
  
	  /*!<-- TCCR2 – Timer/Counter Control Register [7..0] <--*/
	/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	  + FOC2 | WGM20 | COM21 | COM20 | WGM21 | CS22 | CS21 | CS20         +
	  +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/  
		#define TCCR2_WGM_CS( _WGMxx , _CSxx )		TCCR2 |= ( ( _WGMxx & ( ( 1<<WGM21 ) | ( 1<<WGM20 ) ) ) | ( _CSxx & ( ( 1<<CS22 ) | ( 1<<CS21 ) | ( 1<<CS20 ) ) ) )		  
													
	 /*!<-- ATmega32 // End <--*/

#else
	#error Konfiguration nicht vorhanden!
#endif


enum __attribute__( ( packed ) ) eTimer { TIMER0 , TIMER1 , TIMER2 , __MAX_TIMER_ENTRYS__ };

enum __attribute__( ( packed ) ) eTimerCallback
{
	CALLBACK_TIMER0_OVF,
	CALLBACK_TIMER0_COMP,
	CALLBACK_TIMER0_COMPA,
	CALLBACK_TIMER0_COMPB,
	CALLBACK_TIMER1_OVF,
	CALLBACK_TIMER1_COMPB,
	CALLBACK_TIMER1_COMPA,
	CALLBACK_TIMER2_OVF,
	CALLBACK_TIMER2_COMP,
	CALLBACK_TIMER2_COMPA,
	CALLBACK_TIMER2_COMPB,
	
	__CALLBACK_TIMER_MEMBERS__
};

enum __attribute__( ( packed ) ) eTimerError
{
	ERROR_TIMER_OK,
	ERROR_TIMER_NO_ADDRESS,
};


typedef struct
{
    uint8_t uiCnt;
    uint8_t uiCSxx;
    uint8_t uiWGMxx;
}sTimer8Config_t;// 8 Bit Timer Einstellungen

typedef struct
{
	uint16_t uiCnt;
	uint8_t uiCSxx;
	uint8_t uiWGMxx;
}sTimer16Config_t;// 16 Bit Timer Einstellungen

typedef struct  
{
	uint8_t uiLoad8;
	uint16_t uiLoad16;
}sTimerReload_t;



sTimerReload_t volatile sReload[__MAX_TIMER_ENTRYS__];


// pv = PointerVector
void (*pvTimerCallback[__CALLBACK_TIMER_MEMBERS__])(void) =
{
		// Callback Adressen! Werden in den entsprechenden Initalisierungen zugewiesen.
	[CALLBACK_TIMER0_OVF   ] = NULL,
	[CALLBACK_TIMER0_COMP  ] = NULL,
	[CALLBACK_TIMER0_COMPA ] = NULL,
	[CALLBACK_TIMER0_COMPB ] = NULL,
	[CALLBACK_TIMER1_OVF   ] = NULL,
	[CALLBACK_TIMER1_COMPB ] = NULL,
	[CALLBACK_TIMER1_COMPA ] = NULL,
	[CALLBACK_TIMER2_OVF   ] = NULL,
	[CALLBACK_TIMER2_COMP  ] = NULL,
    [CALLBACK_TIMER2_COMPA ] = NULL,
	[CALLBACK_TIMER2_COMPB ] = NULL,
};

/*****************************************************************/


/*!<-- Globale Variablen <--*/
/*****************************************************************/

/*!<-- Timer 0 Konfiguration <--*/
const sTimer8Config_t  sTimer0OcieSettings[]	=
{
		/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		+ Compare Match		 |	Divisor der F_CPU        | Waveform	Generating    +
		+ Vergleichswert     |  (Prescaler)              | Modus ( CTC! )		  +
		++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
	#if (F_CPU == 1000000)
		{ .uiCnt = 9		 , .uiCSxx = _TMR0_PRE_1    , .uiWGMxx = _TMR0_MODE2 }, // 10µS  @1MHz
		{ .uiCnt = 99		 , .uiCSxx = _TMR0_PRE_1    , .uiWGMxx = _TMR0_MODE2 }, // 100µS @1MHz
		{ .uiCnt = 124		 , .uiCSxx = _TMR0_PRE_8    , .uiWGMxx = _TMR0_MODE2 }, // 1ms   @1MHz
	
	#elif (F_CPU == 8000000)
		{ .uiCnt = 79		 , .uiCSxx = _TMR0_PRE_1    , .uiWGMxx = _TMR0_MODE2 }, // 10µS  @8MHz
		{ .uiCnt = 99		 , .uiCSxx = _TMR0_PRE_8    , .uiWGMxx = _TMR0_MODE2 }, // 100µS @8MHz
		{ .uiCnt = 124		 , .uiCSxx = _TMR0_PRE_64   , .uiWGMxx = _TMR0_MODE2 }, // 1ms   @8MHz

	#elif (F_CPU == 16000000)
		{ .uiCnt = 159		 , .uiCSxx = _TMR0_PRE_1    , .uiWGMxx = _TMR0_MODE2 }, // 10µS  @16MHz
		{ .uiCnt = 199		 , .uiCSxx = _TMR0_PRE_8    , .uiWGMxx = _TMR0_MODE2 }, // 100µS @16MHz
		{ .uiCnt = 249		 , .uiCSxx = _TMR0_PRE_64   , .uiWGMxx = _TMR0_MODE2 }, // 1ms   @16MHz
	#else
		#warning F_CPU not declared!
	#endif
};

const sTimer8Config_t  sTimer0OvfSettings[]		=
{
	#if (F_CPU == 1000000)
		{ .uiCnt = 246     , .uiCSxx = _TMR0_PRE_1    , .uiWGMxx = _TMR0_MODE0 }, // 10µS  @1MHz
		{ .uiCnt = 156     , .uiCSxx = _TMR0_PRE_1    , .uiWGMxx = _TMR0_MODE0 }, // 100µS @1MHz
		{ .uiCnt = 131     , .uiCSxx = _TMR0_PRE_8    , .uiWGMxx = _TMR0_MODE0 }, // 1ms   @1MHz
	#endif

