jh-elec/C-Librarys/Atmega - Timer/timer.h
	#if (F_CPU == 8000000)
		{ .uiCnt = 176     , .uiCSxx = _TMR0_PRE_1    , .uiWGMxx = _TMR0_MODE0 }, // 10µS  @8MHz
		{ .uiCnt = 156     , .uiCSxx = _TMR0_PRE_8    , .uiWGMxx = _TMR0_MODE0 }, // 100µS @8MHz
		{ .uiCnt = 131     , .uiCSxx = _TMR0_PRE_64   , .uiWGMxx = _TMR0_MODE0 }, // 1ms   @8MHz
	#endif

	#if (F_CPU == 16000000)
		{ .uiCnt = 96      , .uiCSxx = _TMR0_PRE_1    , .uiWGMxx = _TMR0_MODE0 }, // 10µS  @16MHz
		{ .uiCnt = 56      , .uiCSxx = _TMR0_PRE_8    , .uiWGMxx = _TMR0_MODE0 }, // 100µS @16MHz
		{ .uiCnt = 6       , .uiCSxx = _TMR0_PRE_64   , .uiWGMxx = _TMR0_MODE0 }, // 1ms   @16MHz
	#endif
};
/*!<-- Timer 0 Konfiguration // Ende <--*/


/*!<-- Timer 1 Konfiguration <--*/
const sTimer16Config_t sTimer1OcieSettings[]	=
{
	#if (F_CPU == 1000000)
		{ .uiCnt = 9       , .uiCSxx = _TMR1_PRE_1    , .uiWGMxx = _TMR1_MODE4 }, // 10µS  @1MHz
		{ .uiCnt = 99      , .uiCSxx = _TMR1_PRE_1    , .uiWGMxx = _TMR1_MODE4 }, // 100µS @1MHz
		{ .uiCnt = 124     , .uiCSxx = _TMR1_PRE_8    , .uiWGMxx = _TMR1_MODE4 }, // 1ms   @1MHz
	#endif

	#if (F_CPU == 8000000)
		{ .uiCnt = 7	   , .uiCSxx = _TMR1_PRE_1    , .uiWGMxx = _TMR1_MODE4 }, // 1µS   @8MHz
		{ .uiCnt = 79	   , .uiCSxx = _TMR1_PRE_1    , .uiWGMxx = _TMR1_MODE4 }, // 10µS  @8MHz
		{ .uiCnt = 99	   , .uiCSxx = _TMR1_PRE_8    , .uiWGMxx = _TMR1_MODE4 }, // 100µS @8MHz
		{ .uiCnt = 124     , .uiCSxx = _TMR1_PRE_64   , .uiWGMxx = _TMR1_MODE4 }, // 1ms   @8MHz
	#endif

	#if (F_CPU == 16000000)
		{ .uiCnt = 15       , .uiCSxx = _TMR1_PRE_1    , .uiWGMxx = _TMR1_MODE4 }, // 1µS   @16MHz	
		{ .uiCnt = 159      , .uiCSxx = _TMR1_PRE_1    , .uiWGMxx = _TMR1_MODE4 }, // 10µS  @16MHz
		{ .uiCnt = 199      , .uiCSxx = _TMR1_PRE_8    , .uiWGMxx = _TMR1_MODE4 }, // 100µS @16MHz
		{ .uiCnt = 249      , .uiCSxx = _TMR1_PRE_64   , .uiWGMxx = _TMR1_MODE4 }, // 1ms   @16MHz
	#endif	
};

const sTimer16Config_t sTimer1OvfSettings[]		=
{
	#if (F_CPU == 1000000)
		{ .uiCnt = 65535   , .uiCSxx = _TMR1_PRE_1    , .uiWGMxx = _TMR1_MODE0 }, // 1µS   @1MHz	
		{ .uiCnt = 65526   , .uiCSxx = _TMR1_PRE_1    , .uiWGMxx = _TMR1_MODE0 }, // 10µS  @1MHz
		{ .uiCnt = 65436   , .uiCSxx = _TMR1_PRE_1    , .uiWGMxx = _TMR1_MODE0 }, // 100µS @1MHz
		{ .uiCnt = 65411   , .uiCSxx = _TMR1_PRE_8    , .uiWGMxx = _TMR1_MODE0 }, // 1ms   @1MHz
	#endif

	#if (F_CPU == 8000000)
		{ .uiCnt = 65528   , .uiCSxx = _TMR1_PRE_1    , .uiWGMxx = _TMR1_MODE0 }, // 1µS   @8MHz
		{ .uiCnt = 65456   , .uiCSxx = _TMR1_PRE_1    , .uiWGMxx = _TMR1_MODE0 }, // 10µS  @8MHz
		{ .uiCnt = 65436   , .uiCSxx = _TMR1_PRE_8    , .uiWGMxx = _TMR1_MODE0 }, // 100µS @8MHz
		{ .uiCnt = 65411   , .uiCSxx = _TMR1_PRE_64   , .uiWGMxx = _TMR1_MODE0 }, // 1ms   @8MHz
	#endif

	#if (F_CPU == 16000000)
		{ .uiCnt = 65520  , .uiCSxx = _TMR1_PRE_1    , .uiWGMxx = _TMR1_MODE0 }, // 1µS   @16MHz
		{ .uiCnt = 65376  , .uiCSxx = _TMR1_PRE_1    , .uiWGMxx = _TMR1_MODE0 }, // 10µS  @16MHz
		{ .uiCnt = 65336  , .uiCSxx = _TMR1_PRE_8    , .uiWGMxx = _TMR1_MODE0 }, // 100µS @16MHz
		{ .uiCnt = 65286  , .uiCSxx = _TMR1_PRE_64   , .uiWGMxx = _TMR1_MODE0 }, // 1ms   @16MHz
	#endif	
};
/*!<-- Timer 1 Konfiguration // Ende <--*/



/*!<-- Timer 2 Konfiguration <--*/
const sTimer8Config_t sTimer2OcieSettings[]		=
{
	#if (F_CPU == 1000000)
	{ .uiCnt = 9       , .uiCSxx = _TMR2_PRE_1    , .uiWGMxx = _TMR2_MODE2 }, // 10µS  @1MHz
	{ .uiCnt = 99      , .uiCSxx = _TMR2_PRE_1    , .uiWGMxx = _TMR2_MODE2 }, // 100µS @1MHz
	{ .uiCnt = 124     , .uiCSxx = _TMR2_PRE_8    , .uiWGMxx = _TMR2_MODE2 }, // 1ms   @1MHz
	#endif

	#if (F_CPU == 8000000)
	{ .uiCnt = 7	   , .uiCSxx = _TMR2_PRE_1    , .uiWGMxx = _TMR2_MODE2 }, // 1µS   @8MHz
	{ .uiCnt = 79	   , .uiCSxx = _TMR2_PRE_1    , .uiWGMxx = _TMR2_MODE2 }, // 10µS  @8MHz
	{ .uiCnt = 99	   , .uiCSxx = _TMR2_PRE_8    , .uiWGMxx = _TMR2_MODE2 }, // 100µS @8MHz
	{ .uiCnt = 124     , .uiCSxx = _TMR2_PRE_64   , .uiWGMxx = _TMR2_MODE2 }, // 1ms   @8MHz
	#endif

	#if (F_CPU == 16000000)
	{ .uiCnt = 15       , .uiCSxx = _TMR2_PRE_1    , .uiWGMxx = _TMR2_MODE2 }, // 1µS   @16MHz
	{ .uiCnt = 159      , .uiCSxx = _TMR2_PRE_1    , .uiWGMxx = _TMR2_MODE2 }, // 10µS  @16MHz
	{ .uiCnt = 199      , .uiCSxx = _TMR2_PRE_8    , .uiWGMxx = _TMR2_MODE2 }, // 100µS @16MHz
	{ .uiCnt = 249      , .uiCSxx = _TMR2_PRE_64   , .uiWGMxx = _TMR2_MODE2 }, // 1ms   @16MHz
	#endif
};

const sTimer8Config_t sTimer2OvfSettings[]		=
{
	#if (F_CPU == 1000000)
	{ .uiCnt = 246     , .uiCSxx = _TMR2_PRE_1    , .uiWGMxx = _TMR2_MODE0 }, // 10µS  @1MHz
	{ .uiCnt = 156     , .uiCSxx = _TMR2_PRE_1    , .uiWGMxx = _TMR2_MODE0 }, // 100µS @1MHz
	{ .uiCnt = 131     , .uiCSxx = _TMR2_PRE_8    , .uiWGMxx = _TMR2_MODE0 }, // 1ms   @1MHz
	#endif

	#if (F_CPU == 8000000)
	{ .uiCnt = 176     , .uiCSxx = _TMR2_PRE_1    , .uiWGMxx = _TMR2_MODE0 }, // 10µS  @8MHz
	{ .uiCnt = 156     , .uiCSxx = _TMR2_PRE_8    , .uiWGMxx = _TMR2_MODE0 }, // 100µS @8MHz
	{ .uiCnt = 131     , .uiCSxx = _TMR2_PRE_64   , .uiWGMxx = _TMR2_MODE0 }, // 1ms   @8MHz
	#endif

	#if (F_CPU == 16000000)
	{ .uiCnt = 96      , .uiCSxx = _TMR2_PRE_1    , .uiWGMxx = _TMR2_MODE0 }, // 10µS  @16MHz
	{ .uiCnt = 56      , .uiCSxx = _TMR2_PRE_8    , .uiWGMxx = _TMR2_MODE0 }, // 100µS @16MHz
	{ .uiCnt = 6       , .uiCSxx = _TMR2_PRE_64   , .uiWGMxx = _TMR2_MODE0 }, // 1ms   @16MHz
	#endif
};
/*!<-- Timer 2 Konfiguration // Ende <--*/

/*****************************************************************/


/*!<-- Funktionen <--*/
/*****************************************************************/

extern inline enum eTimerError Timer0CompInit	( const sTimer8Config_t *psTab , void (*pFncCallback)(void) )	
{
	cli(); /**< Vorsichtshalber Interrupts global sperren */
	
	if ( pFncCallback == NULL )
	{
		sei();
		return ERROR_TIMER_NO_ADDRESS;
	}else
	{
		pvTimerCallback[CALLBACK_TIMER0_COMP] = pFncCallback;
	}
	
	#if defined  ( __AVR_ATmega32__ )	
		TCCR0_WGM_CS( psTab->uiWGMxx , psTab->uiCSxx );
		OCR0 = psTab->uiCnt;
		TIMSK_OCIE0_EN;	
	#endif
	
	sei();
	
	return ERROR_TIMER_OK;
}

extern inline enum eTimerError Timer0CompAInit	( const sTimer8Config_t *psTab , void (*pFncCallback)(void) )	
{
	cli(); /**< Vorsichtshalber Interrupts global sperren */
	
