jh-elec/C-Librarys/Atmega - Timer/timer.h
	if ( pFncCallback == NULL )
	{
		sei();
		return ERROR_TIMER_NO_ADDRESS;
	}else
	{
		pvTimerCallback[CALLBACK_TIMER0_COMPA] = pFncCallback;
	}
	
	#if defined  ( __AVR_ATmega328P__ )
		TCCR1A_WGM( psTab->uiWGMxx );
		TCCR1B_WGM_CS( psTab->uiWGMxx , psTab->uiCSxx );
		OCR0A = psTab->uiCnt;
		TIMSK0_OCIE0A_EN;
	#endif
	
	sei();
	
	return ERROR_TIMER_OK;
}

extern inline enum eTimerError Timer0CompBInit	( const sTimer8Config_t *psTab , void (*pFncCallback)(void) )	
{
	cli(); /**< Vorsichtshalber Interrupts global sperren */
	
	if ( pFncCallback == NULL )
	{
		sei();
		return ERROR_TIMER_NO_ADDRESS;
	}else
	{
		pvTimerCallback[CALLBACK_TIMER0_COMPB] = pFncCallback;
	}
	
	#if defined  ( __AVR_ATmega328P__ )
		TCCR1A_WGM( psTab->uiWGMxx );
		TCCR1B_WGM_CS( psTab->uiWGMxx , psTab->uiCSxx );
		OCR0B = psTab->uiCnt;
		TIMSK0_OCIE0B_EN;
	#endif
	
	sei();
	
	return ERROR_TIMER_OK;
}

extern inline enum eTimerError Timer0OvfInit	( const sTimer8Config_t *psTab , void (*pFncCallback)(void) )	
{
	cli(); /**< Vorsichtshalber Interrupts global sperren */
	
	if ( pFncCallback == NULL )
	{
		sei();
		return ERROR_TIMER_NO_ADDRESS;
	}else
	{
		pvTimerCallback[CALLBACK_TIMER0_OVF] = pFncCallback;
	}
		
	#if defined  ( __AVR_ATmega32__ )
		TCCR0_WGM_CS( psTab->uiWGMxx , psTab->uiCSxx );
		TIMSK_TOIE0_EN;
	#elif defined ( __AVR_ATmega328P__ )
		TCCR0B_WGM_CS( psTab->uiWGMxx , psTab->uiCSxx );
		TCCR0A_WGM( psTab->uiWGMxx );
		TIMSK0_TOIE0_EN;
	#endif
	
	TCNT0 = psTab->uiCnt;
	sReload[TIMER0].uiLoad8 = TCNT0;
	
	sei();
	
	return ERROR_TIMER_OK;
}


#ifdef TIMER0_COMP_vect
ISR ( TIMER0_COMP_vect )
{
	pvTimerCallback[CALLBACK_TIMER0_COMP]();
}
#endif

#ifdef TIMER0_COMPA_vect
ISR ( TIMER0_COMPA_vect )
{
	pvTimerCallback[CALLBACK_TIMER0_COMPA]();
}
#endif

#ifdef TIMER0_COMPB_vect
ISR ( TIMER0_COMPB_vect )
{
	pvTimerCallback[CALLBACK_TIMER0_COMPB]();
}
#endif

#ifdef TIMER0_OVF_vect
ISR ( TIMER0_OVF_vect )
{
	pvTimerCallback[CALLBACK_TIMER0_OVF]();
	TCNT0 = sReload[TIMER0].uiLoad8;
}
#endif



extern inline enum eTimerError Timer1CompAInit	( const sTimer16Config_t *psTab , void (*pFncCallback)(void) )	
{
	cli(); /**< Vorsichtshalber Interrupts global sperren */
	
	if ( pFncCallback == NULL )
	{
		sei();
		return ERROR_TIMER_NO_ADDRESS;
	}else
	{
		pvTimerCallback[CALLBACK_TIMER1_COMPA] = pFncCallback;
	}
	
	#if defined  ( __AVR_ATmega32__ )
		TCCR1A_WGM( psTab->uiWGMxx );
		TCCR1B_WGM_CS( psTab->uiWGMxx , psTab->uiCSxx );
		OCR1A = psTab->uiCnt;
		TIMSK_OCIE1A_EN;
	#elif defined ( __AVR_ATmega328P__ )
		TCCR1A_WGM( psTab->uiWGMxx );
		TCCR1B_WGM_CS( psTab->uiWGMxx  , psTab->uiCSxx );
		OCR1A = psTab->uiCnt;
		TIMSK1_OCIE1A_EN;
	#endif

	sei();
	
	return ERROR_TIMER_OK;
}

extern inline enum eTimerError Timer1CompBInit	( const sTimer16Config_t *psTab , void (*pFncCallback)(void) )	
{
	cli(); /**< Vorsichtshalber Interrupts global sperren */
	
	if ( pFncCallback == NULL )
	{
		sei();
		return ERROR_TIMER_NO_ADDRESS;
	}else
	{
		pvTimerCallback[CALLBACK_TIMER1_COMPB] = pFncCallback;
	}
	
	#if defined  ( __AVR_ATmega32__ )
		TCCR1A_WGM( psTab->uiWGMxx );
		TCCR1B_WGM_CS( psTab->uiWGMxx , psTab->uiCSxx );
		OCR1B = psTab->uiCnt;
		TIMSK_OCIE1B_EN;
	#elif defined ( __AVR_ATmega328P__ )
		TCCR1A_WGM( psTab->uiWGMxx );
		TCCR1B_WGM_CS( psTab->uiWGMxx , psTab->uiCSxx );
		OCR1B = psTab->uiCnt;
		TIMSK1_OCIE1B_EN;
	#endif

	sei();
	
	return ERROR_TIMER_OK;
}

extern inline enum eTimerError Timer1OvfInit	( const sTimer16Config_t *psTab , void (*pFncCallback)(void) )	
{
	cli(); /**< Vorsichtshalber Interrupts global sperren */

	if ( pFncCallback == NULL )
	{
		sei();
		return ERROR_TIMER_NO_ADDRESS;
	}else
	{
		pvTimerCallback[CALLBACK_TIMER1_OVF] = pFncCallback;
	}
		
		
	#if defined  ( __AVR_ATmega32__ )
		TCCR1A_WGM( psTab->uiWGMxx );
		TCCR1B_WGM_CS( psTab->uiWGMxx , psTab->uiCSxx );
		TIMSK_TOIE1_EN;
	#elif defined ( __AVR_ATmega328P__ )
		TCCR1A_WGM( psTab->uiWGMxx );
		TCCR1B_WGM_CS( psTab->uiWGMxx , psTab->uiCSxx );
		TIMSK1_TOIE1_EN;
	#endif

	TCNT1 = psTab->uiCnt;
	sReload[TIMER1].uiLoad16 = TCNT1;

	sei();
	
	return ERROR_TIMER_OK;	
}


#ifdef TIMER1_COMPA_vect
ISR ( TIMER1_COMPA_vect )
{
	pvTimerCallback[CALLBACK_TIMER1_COMPA]();
}
#endif

#ifdef TIMER1_COMPB_vect
ISR ( TIMER1_COMPB_vect )
{
	pvTimerCallback[CALLBACK_TIMER1_COMPB]();
}
#endif

#ifdef TIMER1_OVF_vect
ISR ( TIMER1_OVF_vect )
{
	pvTimerCallback[CALLBACK_TIMER1_OVF]();
	TCNT1 = sReload[TIMER1].uiLoad16;
};
#endif



extern inline enum eTimerError Timer2CompInit	( const sTimer8Config_t *psTab  , void (*pFncCallback)(void) )	
{
	cli(); /**< Vorsichtshalber Interrupts global sperren */

	if ( pFncCallback == NULL )
	{
		sei();
		return ERROR_TIMER_NO_ADDRESS;
	}else
	{
		pvTimerCallback[CALLBACK_TIMER2_COMP] = pFncCallback;
	}
	
	#if defined  ( __AVR_ATmega32__ )
		TCCR2_WGM_CS( psTab->uiWGMxx , psTab->uiCSxx );
		OCR2 = psTab->uiCnt;
		TIMSK_OCIE2_EN;
	#endif

	sei();
	
	return ERROR_TIMER_OK;	
};

extern inline enum eTimerError Timer2CompAInit	( const sTimer8Config_t *psTab , void (*pFncCallback)(void) )	
{
	cli(); /**< Vorsichtshalber Interrupts global sperren */

	if ( pFncCallback == NULL )
	{
		sei();
		return ERROR_TIMER_NO_ADDRESS;
	}else
	{
		pvTimerCallback[CALLBACK_TIMER2_COMPA] = pFncCallback;
	}
	
	#if defined  ( __AVR_ATmega328P__ )
		TCCR2A_WGM( psTab->uiWGMxx );
		TCCR2B_WGM_CS( psTab->uiWGMxx , psTab->uiCSxx );
		TCCR2A = psTab->uiCnt;
		TIMSK2_OCIE2A_EN;
	#endif

	sei();
	
	return ERROR_TIMER_OK;	
}

extern inline enum eTimerError Timer2CompBInit	( const sTimer8Config_t *psTab , void (*pFncCallback)(void) )	
{
	cli(); /**< Vorsichtshalber Interrupts global sperren */

	if ( pFncCallback == NULL )
	{
		sei();
		return ERROR_TIMER_NO_ADDRESS;
	}else
	{
		pvTimerCallback[CALLBACK_TIMER2_COMPB] = pFncCallback;
	}
	
	#if defined  ( __AVR_ATmega328P__ )
		TCCR2A_WGM( psTab->uiWGMxx );
		TCCR2B_WGM_CS( psTab->uiWGMxx , psTab->uiCSxx );
		OCR2B = psTab->uiCnt;
		TIMSK2_OCIE2B_EN;
	#endif

	sei();
	
	return ERROR_TIMER_OK;
}

extern inline enum eTimerError Timer2OvfInit	( const sTimer8Config_t *psTab  , void (*pFncCallback)(void) )	
{
	cli(); /**< Vorsichtshalber Interrupts global sperren */

	if ( pFncCallback == NULL )
	{
		sei();
		return ERROR_TIMER_NO_ADDRESS;
	}else
	{
		pvTimerCallback[CALLBACK_TIMER2_OVF] = pFncCallback;
	}
	
	
	#if defined  ( __AVR_ATmega32__ )
		TCCR2_WGM_CS( psTab->uiWGMxx , psTab->uiCSxx );
		TIMSK_TOIE2_EN;
	#elif defined ( __AVR_ATmega328P__ )
		TCCR2A_WGM( psTab->uiWGMxx );
		TCCR2B_WGM_CS( psTab->uiWGMxx , psTab->uiCSxx );
		TIMSK2_TOIE2_EN;
	#endif
	
	TCNT2 = psTab->uiCnt;
	sReload[TIMER2].uiLoad8 = TCNT2;	
 
	sei();
	
	return ERROR_TIMER_OK;
};


#ifdef TIMER2_COMP_vect		
ISR ( TIMER2_COMP_vect )	
{
	pvTimerCallback[CALLBACK_TIMER2_COMP]();
}
#endif

#ifdef TIMER2_COMPA_vect
ISR ( TIMER2_COMPA_vect )
{
	pvTimerCallback[CALLBACK_TIMER2_COMPA]();
}
#endif

#ifdef TIMER2_COMPB_vect
ISR ( TIMER2_COMPB_vect )
{
	pvTimerCallback[CALLBACK_TIMER2_COMPB]();
}
#endif

#ifdef TIMER2_OVF_vect		
ISR ( TIMER2_OVF_vect )		
{
	pvTimerCallback[CALLBACK_TIMER2_OVF]();
	TCNT2 = sReload[TIMER2].uiLoad16;
}
#endif


/*****************************************************************/


// end of file


#endif // __TIMER_H__
